Tekla.Structures.Model.PolyBeam
The PolyBeam class represents a continuous beam with a contour as input.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
ContourPoint point = new ContourPoint(new Point(0,2000,0), null);
ContourPoint point2 = new ContourPoint(new Point(2000,2000,0), null);
ContourPoint point3 = new ContourPoint(new Point(0,4000,0), null);
PolyBeam PolyBeam = new PolyBeam();
PolyBeam.AddContourPoint(point);
PolyBeam.AddContourPoint(point2);
PolyBeam.AddContourPoint(point3);
PolyBeam.Profile.ProfileString = "HEA400";
PolyBeam.Finish = "PAINT";
bool Result = false;
Result = PolyBeam.Insert();
}
}

Tekla.Structures.Model.PolyBeam.type
The type of the PolyBeam.

Tekla.Structures.Model.PolyBeam.Type
Gets the read only type of the polybeam.
The default type for a new polybeam instance is beam.

Tekla.Structures.Model.PolyBeam.Contour
Gets or sets the contour for the polybeam.

Tekla.Structures.Model.PolyBeam.StartLevelName
Gets or sets the start level name.

Tekla.Structures.Model.PolyBeam.EndLevelName
Gets or sets the end level name.

Tekla.Structures.Model.PolyBeam.StartLevelOffset
Gets or sets the start level offset.

Tekla.Structures.Model.PolyBeam.EndLevelOffset
Gets or sets the end level offset.

Tekla.Structures.Model.PolyBeam.#ctor
Initializes a new instance of the Tekla.Structures.Model.PolyBeam class.

Tekla.Structures.Model.PolyBeam.#ctor(Tekla.Structures.Model.PolyBeam.PolyBeamTypeEnum)
Initializes a new instance of the Tekla.Structures.Model.PolyBeam class by using the defined type.
polyBeamType: The type of the polybeam.

Tekla.Structures.Model.PolyBeam.AddContourPoint(Tekla.Structures.Model.ContourPoint)
Adds a contour point to the polybeam.
contourPoint: The contour point to be added to the polybeam.
Returns: True on success, false if there is no more space for another contour point.

Tekla.Structures.Model.PolyBeam.Insert
Inserts the polybeam into the model database. All the attributes must be set.
Returns: True on success.

Tekla.Structures.Model.PolyBeam.Select
Selects a polybeam from the model database. The identifier of the polybeam must be set.
Returns: True on success.

Tekla.Structures.Model.PolyBeam.Modify
Modifies the existing polybeam in the model database to match the current one.
Returns: True on success.

Tekla.Structures.Model.PolyBeam.Delete
Deletes the polybeam instance with the given identifier from the model database.
Returns: True on success.

Tekla.Structures.Model.PolyBeam.GetPolybeamCoordinateSystems
Returns a list of coordinate systems for the polybeam segments.
Returns: A list of coordinate systems for the polybeam segments.

Tekla.Structures.Model.PolyBeam.GetCenterLinePolycurve
Get centerline as polycurve
Returns: Polycurve instance or null